app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  def index
    if !params[:artist_id].present?
      @songs = Song.all
    elsif Artist.find_by(id: params[:artist_id])
      @songs = Artist.find(params[:artist_id]).songs

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if Song.find_by(id: params[:id])